In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
WARNING: There was an error checking the latest version of pip.

In [2]:
%load_ext sql

In [3]:
import os

USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [4]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)
CONNECT_DATA

'postgresql://reader:Miba2021@10.129.0.25/demo'

In [5]:
%%sql $CONNECT_DATA
    SELECT * FROM pg_database

4 rows affected.

[(13760, 'postgres', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, True, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13759, 'template0', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, False, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (16384, 'demo', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, '{=Tc/postgres,postgres=CTc/postgres,reader=c/postgres}')]

In [6]:
%sql SELECT DISTINCT arrival_airport, aircraft_code FROM flights f \
        WHERE f.arrival_airport='AER'

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('AER', '773'),
 ('AER', '733'),
 ('AER', '763'),
 ('AER', 'CN1'),
 ('AER', 'SU9'),
 ('AER', 'CR2'),
 ('AER', '319')]

In [8]:
res = %sql SELECT DISTINCT fare_conditions FROM ticket_flights \
         WHERE flight_id IN( \
             SELECT flight_id FROM flights\
             WHERE arrival_airport = 'SVO' AND departure_airport = 'AER')

 * postgresql://reader:***@10.129.0.25/demo
3 rows affected.

In [19]:
res = %sql SELECT DISTINCT model FROM aircrafts \
         WHERE aircraft_code IN( \
             SELECT aircraft_code FROM flights \
             WHERE departure_airport IN (\
                 SELECT airport_code FROM airports\
                 WHERE city = 'Yakutsk'))\
        AND aircraft_code IN(\
            SELECT aircraft_code FROM flights \
             WHERE departure_airport IN (\
                 SELECT airport_code FROM airports\
                 WHERE city = 'Abakan'))

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

In [20]:
res = %sql SELECT model FROM aircrafts a \
            JOIN

[('Airbus A319-100',)]

***Query 1 Which fare conditions are available for flights from AER to SVO***

In [8]:
 %sql SELECT distinct fare_conditions FROM ticket_flights tf \
           JOIN flights f ON f.flight_id = tf.flight_id \
           WHERE f.arrival_airport = 'SVO' AND departure_airport = 'AER'

 * postgresql://reader:***@10.129.0.25/demo
3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

***Query 2 A list of aircraft models which fly to the Yakutsk AND Abakan cities***

In [9]:
%sql SELECT DISTINCT model FROM aircrafts a \
          JOIN flights f ON f.aircraft_code = a.aircraft_code \
          JOIN airports ap ON ap.airport_code = f.departure_airport \
          WHERE ap.city IN ('Yakutsk', 'Abakan') \
          GROUP BY model \
          HAVING COUNT(DISTINCT ap.city) = 2

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('Airbus A319-100',)]

In [36]:
display(res)

[('Airbus A319-100',)]

***Query 3 A list of aircraft models which fly to the Yakutsk OR Abakan cities***

In [10]:
%sql SELECT DISTINCT model FROM aircrafts a \
      JOIN flights f ON f.aircraft_code = a.aircraft_code \
      JOIN airports ap ON ap.airport_code = f.departure_airport \
      WHERE city IN ('Yakutsk', 'Abakan')

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Bombardier CRJ-200',),
 ('Sukhoi Superjet-100',),
 ('Airbus A319-100',),
 ('Cessna 208 Caravan',),
 ('Boeing 737-300',)]

***Query 4 A list of aircrafts which DONâ€™T fly to Yakutsk city***

In [11]:
%sql SELECT DISTINCT model FROM aircrafts a \
            JOIN flights f ON f.aircraft_code = a.aircraft_code \
            JOIN airports ap ON ap.airport_code = f.arrival_airport \
            WHERE a.aircraft_code NOT IN( \
                SELECT aircraft_code FROM flights \
                WHERE arrival_airport IN(\
                    SELECT airport_code FROM airports WHERE city = 'Yakutsk') \
                OR departure_airport IN(\
                    SELECT airport_code FROM airports WHERE city = 'Yakutsk'))

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Boeing 767-300',),
 ('Cessna 208 Caravan',),
 ('Boeing 737-300',),
 ('Airbus A321-200',),
 ('Boeing 777-300',)]

***Query 5 Find out airport codes related to Mrs. ELLA DMITRIEVA  - from where and to where she flew.***

In [12]:
%sql SELECT departure_airport, arrival_airport FROM flights f\
            JOIN ticket_flights tf ON tf.flight_id = f.flight_id \
            JOIN tickets t ON t.ticket_no = tf.ticket_no \
            WHERE passenger_name = 'ELLA DMITRIEVA'

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('DME', 'UUS'),
 ('DME', 'HMA'),
 ('HMA', 'DME'),
 ('SVO', 'SVX'),
 ('SVX', 'SVO'),
 ('SVX', 'MQF'),
 ('MQF', 'SVX')]